# LinePattern Constructor (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePattern Constructor (String)
LinePattern Class See Also
---
Creates a line pattern with given name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LinePattern(
	string name
)
```

Visual Basic
---
```text
Public Sub New ( _
	name As String _
)
```

Visual C++
---
```text
public:
LinePattern(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String The name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LinePattern Class
LinePattern Overload
Autodesk.Revit.DB Namespace